Tekla Open API Reference for Tekla Structures 2025
RebarSplitter.StaggerTypeEnum Enumeration
 The side of the split that the additional offset (stagger) is located.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum StaggerTypeEnum
Public Enumeration StaggerTypeEnum
Members
Member name | Value | Description
NO_STAGGER | 0 |  No stagger.
STAGGER_LEFT | 1 |  Stagger left.
STAGGER_RIGHT | 2 |  Stagger right.
STAGGER_MIDDLE | 3 |  Stagger middle.
See Also
Reference
Tekla.Structures.Model Namespace